Revit 2015 API
TableView.IsOkToEditParam Method
 Prompts the user to see if it is OK to edit the type parameter associated with a given table cell.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public bool IsOkToEditParam(
	SectionType sectionType,
	int nRow,
	int nCol
)
Visual Basic
Public Function IsOkToEditParam ( _
	sectionType As SectionType, _
	nRow As Integer, _
	nCol As Integer _
) As Boolean
Visual C++
public:
bool IsOkToEditParam(
	SectionType sectionType,
	int nRow,
	int nCol
)
Parameters
sectionType
Type: Autodesk.Revit.DB.SectionType
nRow
Type: System.Int32
nCol
Type: System.Int32
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The sectionType is not a valid type for this view.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given row number nRow is invalid. -or- The given column number nCol is invalid. -or- A value passed for an enumeration argument is not a member of that enumeration
See Also
TableView Class
Autodesk.Revit.DB Namespace